; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_17_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 - counter
	)
  (:init
		(= (value c0) 30)
	(= (value c1) 53)
	(= (value c2) 76)
	(= (value c3) 98)
	(= (value c4) 9)
	(= (value c5) 25)
	(= (value c6) 89)
	(= (value c7) 16)
	(= (value c8) 5)
	(= (value c9) 51)
	(= (value c10) 4)
	(= (value c11) 26)
	(= (value c12) 53)
	(= (value c13) 83)
	(= (value c14) 42)
	(= (value c15) 60)
	(= (value c16) 94)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
		)
	)
)

; plan
1. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 11 of 16
2. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 11 of 16
3. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 11 of 16
4. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 11 of 16
5. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 11 of 16
6. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 11 of 16
7. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 11 of 16
8. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 11 of 16
9. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 11 of 16
10. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 11 of 16
11. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 11 of 16
12. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 11 of 16
13. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 11 of 16
14. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 11 of 16
15. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 11 of 16
16. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 11 of 16
17. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 11 of 16
18. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 11 of 16
19. (increment c8)
   changed: (value c8) from 5 to 9
   goals met: 11 of 16
20. (increment c8)
   changed: (value c8) from 9 to 13
   goals met: 11 of 16
21. (increment c8)
   changed: (value c8) from 13 to 17
   goals met: 12 of 16
22. (increase_rate c14)
   changed: (rate_value c14) from 5 to 6
   goals met: 12 of 16
23. (increase_rate c14)
   changed: (rate_value c14) from 6 to 7
   goals met: 12 of 16
24. (increment c14)
   changed: (value c14) from 42 to 49
   goals met: 12 of 16
25. (increment c14)
   changed: (value c14) from 49 to 56
   goals met: 12 of 16
26. (increment c14)
   changed: (value c14) from 56 to 63
   goals met: 11 of 16
27. (increase_rate c14)
   changed: (rate_value c14) from 7 to 8
   goals met: 11 of 16
28. (increase_rate c14)
   changed: (rate_value c14) from 8 to 9
   goals met: 11 of 16
29. (increase_rate c14)
   changed: (rate_value c14) from 9 to 10
   goals met: 11 of 16
30. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 11 of 16
31. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 11 of 16
32. (decrement c14)
   changed: (value c14) from 63 to 53
   goals met: 12 of 16
33. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 12 of 16
34. (increment c14)
   changed: (value c14) from 53 to 63
   goals met: 11 of 16
35. (decrement c13)
   changed: (value c13) from 83 to 77
   goals met: 11 of 16
36. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 11 of 16
37. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 11 of 16
38. (increment c7)
   changed: (value c7) from 16 to 24
   goals met: 10 of 16
39. (increment c8)
   changed: (value c8) from 17 to 21
   goals met: 10 of 16
40. (increment c8)
   changed: (value c8) from 21 to 25
   goals met: 11 of 16
41. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 11 of 16
42. (increment c7)
   changed: (value c7) from 24 to 33
   goals met: 10 of 16
43. (increment c7)
   changed: (value c7) from 33 to 42
   goals met: 10 of 16
44. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 10 of 16
45. (increment c8)
   changed: (value c8) from 25 to 30
   goals met: 10 of 16
46. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 10 of 16
47. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 10 of 16
48. (increment c7)
   changed: (value c7) from 42 to 52
   goals met: 10 of 16
49. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 10 of 16
50. (increment c8)
   changed: (value c8) from 30 to 35
   goals met: 10 of 16
51. (increment c8)
   changed: (value c8) from 35 to 40
   goals met: 10 of 16
52. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 10 of 16
53. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 10 of 16
54. (increment c7)
   changed: (value c7) from 52 to 62
   goals met: 10 of 16
55. (increment c8)
   changed: (value c8) from 40 to 45
   goals met: 10 of 16
56. (increment c8)
   changed: (value c8) from 45 to 50
   goals met: 10 of 16
57. (decrement c14)
   changed: (value c14) from 63 to 53
   goals met: 11 of 16
58. (decrement c13)
   changed: (value c13) from 77 to 71
   goals met: 11 of 16
59. (decrement c13)
   changed: (value c13) from 71 to 65
   goals met: 11 of 16
60. (increment c14)
   changed: (value c14) from 53 to 63
   goals met: 10 of 16
61. (decrement c13)
   changed: (value c13) from 65 to 59
   goals met: 11 of 16
62. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 11 of 16
63. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 11 of 16
64. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 11 of 16
65. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 11 of 16
66. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 11 of 16
67. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 11 of 16
68. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 11 of 16
69. (increment c10)
   changed: (value c10) from 4 to 11
   goals met: 11 of 16
70. (increment c10)
   changed: (value c10) from 11 to 18
   goals met: 11 of 16
71. (increment c10)
   changed: (value c10) from 18 to 25
   goals met: 11 of 16
72. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 11 of 16
73. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 11 of 16
74. (increment c10)
   changed: (value c10) from 25 to 32
   goals met: 10 of 16
75. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 10 of 16
76. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 10 of 16
77. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 10 of 16
78. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 10 of 16
79. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 10 of 16
80. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 10 of 16
81. (decrement c10)
   changed: (value c10) from 32 to 22
   goals met: 11 of 16
82. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 11 of 16
83. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 11 of 16
84. (decrement c6)
   changed: (value c6) from 89 to 83
   goals met: 11 of 16
85. (decrement c6)
   changed: (value c6) from 83 to 77
   goals met: 11 of 16
86. (decrement c6)
   changed: (value c6) from 77 to 71
   goals met: 11 of 16
87. (decrement c6)
   changed: (value c6) from 71 to 65
   goals met: 11 of 16
88. (decrement c6)
   changed: (value c6) from 65 to 59
   goals met: 12 of 16
89. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 12 of 16
90. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 12 of 16
91. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 12 of 16
92. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 12 of 16
93. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 12 of 16
94. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 12 of 16
95. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 12 of 16
96. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 12 of 16
97. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 12 of 16
98. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 12 of 16
99. (increment c4)
   changed: (value c4) from 9 to 19
   goals met: 12 of 16
100. (increment c4)
   changed: (value c4) from 19 to 29
   goals met: 11 of 16
101. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 11 of 16
102. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 11 of 16
103. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 11 of 16
104. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 11 of 16
105. (increment c4)
   changed: (value c4) from 29 to 39
   goals met: 11 of 16
106. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 11 of 16
107. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 11 of 16
108. (decrement c4)
   changed: (value c4) from 39 to 29
   goals met: 11 of 16
109. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 11 of 16
110. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 11 of 16
111. (decrement c4)
   changed: (value c4) from 29 to 19
   goals met: 12 of 16
112. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 12 of 16
113. (increment c4)
   changed: (value c4) from 19 to 29
   goals met: 11 of 16
114. (decrement c3)
   changed: (value c3) from 98 to 89
   goals met: 11 of 16
115. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 11 of 16
116. (decrement c4)
   changed: (value c4) from 29 to 19
   goals met: 12 of 16
117. (decrement c3)
   changed: (value c3) from 89 to 79
   goals met: 12 of 16
118. (increment c4)
   changed: (value c4) from 19 to 29
   goals met: 11 of 16
119. (increment c4)
   changed: (value c4) from 29 to 39
   goals met: 11 of 16
120. (decrement c3)
   changed: (value c3) from 79 to 69
   goals met: 10 of 16
121. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 10 of 16
122. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 10 of 16
123. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 10 of 16
124. (increment c5)
   changed: (value c5) from 25 to 28
   goals met: 10 of 16
125. (increment c5)
   changed: (value c5) from 28 to 31
   goals met: 10 of 16
126. (increment c5)
   changed: (value c5) from 31 to 34
   goals met: 10 of 16
127. (increment c5)
   changed: (value c5) from 34 to 37
   goals met: 10 of 16
128. (increment c5)
   changed: (value c5) from 37 to 40
   goals met: 11 of 16
129. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 11 of 16
130. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 11 of 16
131. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 11 of 16
132. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 11 of 16
133. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 11 of 16
134. (increment c10)
   changed: (value c10) from 22 to 32
   goals met: 10 of 16
135. (decrement c7)
   changed: (value c7) from 62 to 52
   goals met: 9 of 16
136. (decrement c7)
   changed: (value c7) from 52 to 42
   goals met: 10 of 16
137. (decrement c6)
   changed: (value c6) from 59 to 53
   goals met: 10 of 16
138. (decrement c6)
   changed: (value c6) from 53 to 47
   goals met: 10 of 16
139. (decrement c6)
   changed: (value c6) from 47 to 41
   goals met: 11 of 16
140. (decrement c3)
   changed: (value c3) from 69 to 59
   goals met: 11 of 16
141. (decrement c3)
   changed: (value c3) from 59 to 49
   goals met: 11 of 16
142. (decrement_rate c3)
   changed: (rate_value c3) from 10 to 9
   goals met: 11 of 16
143. (increment c3)
   changed: (value c3) from 49 to 58
   goals met: 11 of 16
144. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 11 of 16
145. (increment c3)
   changed: (value c3) from 58 to 68
   goals met: 11 of 16
146. (increment c3)
   changed: (value c3) from 68 to 78
   goals met: 12 of 16
147. (increment c10)
   changed: (value c10) from 32 to 42
   goals met: 12 of 16
148. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 12 of 16
149. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 12 of 16
150. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 12 of 16
151. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 12 of 16
152. (increment c11)
   changed: (value c11) from 26 to 30
   goals met: 12 of 16
153. (increment c11)
   changed: (value c11) from 30 to 34
   goals met: 12 of 16
154. (increment c11)
   changed: (value c11) from 34 to 38
   goals met: 12 of 16
155. (increment c11)
   changed: (value c11) from 38 to 42
   goals met: 12 of 16
156. (increment c11)
   changed: (value c11) from 42 to 46
   goals met: 13 of 16
157. (increment c10)
   changed: (value c10) from 42 to 52
   goals met: 13 of 16
158. (increment c11)
   changed: (value c11) from 46 to 50
   goals met: 13 of 16
159. (increment c11)
   changed: (value c11) from 50 to 54
   goals met: 13 of 16
160. (decrement c14)
   changed: (value c14) from 63 to 53
   goals met: 13 of 16
161. (decrement c13)
   changed: (value c13) from 59 to 53
   goals met: 12 of 16
162. (decrement c13)
   changed: (value c13) from 53 to 47
   goals met: 13 of 16
163. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 13 of 16
164. (increment c13)
   changed: (value c13) from 47 to 53
   goals met: 12 of 16
165. (increment c14)
   changed: (value c14) from 53 to 63
   goals met: 12 of 16
166. (increment c13)
   changed: (value c13) from 53 to 59
   goals met: 13 of 16
167. (increment c12)
   changed: (value c12) from 53 to 54
   goals met: 13 of 16
168. (increment c12)
   changed: (value c12) from 54 to 55
   goals met: 14 of 16
169. (decrement c3)
   changed: (value c3) from 78 to 68
   goals met: 13 of 16
170. (decrement c3)
   changed: (value c3) from 68 to 58
   goals met: 13 of 16
171. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 13 of 16
172. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 13 of 16
173. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 13 of 16
174. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 13 of 16
175. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 13 of 16
176. (decrement c2)
   changed: (value c2) from 76 to 71
   goals met: 13 of 16
177. (decrement c2)
   changed: (value c2) from 71 to 66
   goals met: 13 of 16
178. (decrement c2)
   changed: (value c2) from 66 to 61
   goals met: 13 of 16
179. (decrement c2)
   changed: (value c2) from 61 to 56
   goals met: 14 of 16
180. (decrement c3)
   changed: (value c3) from 58 to 48
   goals met: 13 of 16
181. (decrement c3)
   changed: (value c3) from 48 to 38
   goals met: 14 of 16
182. (decrement c2)
   changed: (value c2) from 56 to 51
   goals met: 13 of 16
183. (decrement c2)
   changed: (value c2) from 51 to 46
   goals met: 13 of 16
184. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 13 of 16
185. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 13 of 16
186. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 13 of 16
187. (decrement c2)
   changed: (value c2) from 46 to 41
   goals met: 13 of 16
188. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 13 of 16
189. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 13 of 16
190. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 13 of 16
191. (decrement c2)
   changed: (value c2) from 41 to 36
   goals met: 14 of 16
192. (decrement c1)
   changed: (value c1) from 53 to 47
   goals met: 14 of 16
193. (decrement c1)
   changed: (value c1) from 47 to 41
   goals met: 14 of 16
194. (decrement c1)
   changed: (value c1) from 41 to 35
   goals met: 15 of 16
195. (decrement c14)
   changed: (value c14) from 63 to 53
   goals met: 15 of 16
196. (decrement c13)
   changed: (value c13) from 59 to 53
   goals met: 14 of 16
197. (decrement c13)
   changed: (value c13) from 53 to 47
   goals met: 15 of 16
198. (increase_rate c13)
   changed: (rate_value c13) from 6 to 7
   goals met: 15 of 16
199. (increase_rate c13)
   changed: (rate_value c13) from 7 to 8
   goals met: 15 of 16
200. (increment c13)
   changed: (value c13) from 47 to 55
   goals met: 14 of 16
201. (increment c14)
   changed: (value c14) from 53 to 63
   goals met: 14 of 16
202. (increment c13)
   changed: (value c13) from 55 to 63
   goals met: 14 of 16
203. (increment c14)
   changed: (value c14) from 63 to 73
   goals met: 15 of 16
204. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 15 of 16
205. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 15 of 16
206. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 15 of 16
207. (increase_rate c15)
   changed: (rate_value c15) from 3 to 4
   goals met: 15 of 16
208. (increment c15)
   changed: (value c15) from 60 to 64
   goals met: 15 of 16
209. (increment c15)
   changed: (value c15) from 64 to 68
   goals met: 15 of 16
210. (increment c15)
   changed: (value c15) from 68 to 72
   goals met: 15 of 16
211. (increment c15)
   changed: (value c15) from 72 to 76
   goals met: 16 of 16
